Revit 2027 API
ExtendedPropertiesLinkData.Region Property
 The region of the account that contains the parameter definitions.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Region { get; set; }
Public Property Region As String
	Get
	Set
public:
property String^ Region {
	String^ get ();
	void set (String^ value);
}
member Region : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The region is not valid.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExtendedPropertiesLinkData Class
Autodesk.Revit.DB.ExternalData Namespace